app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.find_or_create_with_omniauth(auth)
---
INSERT INTO "users" ("access_token", "created_at", "email", "name", "photo_url", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"